Revit 2027 API
BuiltInFailures.RebarSystemFailures.InvalidLapSpliceInAreaReinforcement Property
 The instance major/minor lap lengths must be smaller than 1/2 of the overall length from the type in major and minor directions, respectively. The default values set for this parameters did not respect this criteria so they were automatically reset to the type values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidLapSpliceInAreaReinforcement { get; }
Public Shared ReadOnly Property InvalidLapSpliceInAreaReinforcement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidLapSpliceInAreaReinforcement {
	FailureDefinitionId^ get ();
}
static member InvalidLapSpliceInAreaReinforcement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace